# Not on homebrew:
# teamsql, DBeaver
# openvpn, tunnelblick, Wireshark
# Itsycal, Be Focused, Google Backup and sync
# RecordIt
# RN: Xcode, # brew 'cocoapods' # cask 'java8' # react-native needs this version for android studio to build apk # cask 'intellij-idea' # cask 'android-studio' # mas 'Apple Configurator 2', id: 1037126344 # cask 'fastlane'

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# brew 'docker'
# brew 'docker-compose' # use Docker Desktop https://docs.docker.com/v17.09/docker-for-mac/install/
# brew 'postgresql' # install via http://postgresapp.com/
# brew 'pgcli'
# brew 'node' # use nvm
# brew 'mongodb' # use mongodb compass
brew 'go'
# brew 'python'
brew 'python3'
brew 'ruby'

brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'bash'
brew 'bash-completion'
brew 'wget'
# More recent versions of some OS X tools
brew 'vim' # , args: ['--with-override-system-vi']
brew 'grep'
brew 'openssh'
brew 'hub' # `hub fork`, `hub create`, `hub checkout <PRurl>`, https://github.com/github/hub
brew 'mtr' # mtr - ping & traceroute.
brew 'starship'
brew "bat" # cat(1) with syntax highlighting and Git integration
brew "exa" # for 'ls'
brew 'the_silver_searcher'
brew 'z'
brew 'fzf'
brew 'pv'
brew 'rename'
brew 'tree'
brew 'terminal-notifier'
brew 'pidcat' # colored logcat
brew 'ncdu'   # find where your diskspace went
brew 'zsh'
brew 'git-lfs' # https://git-lfs.github.com/
brew 'jq'
brew 'ack'
brew 'gnupg' # GnuPG to enable PGP-signing commits
brew 'screen'
brew 'awscli'

cask_args appdir: '/Applications'

cask 'virtualbox'
cask 'visual-studio-code'
cask 'postico'
# cask 'dbeaver-community'
cask 'skype'
cask 'firefox'
# cask 'google-chrome'
cask 'slack'
cask 'spectacle'
cask 'iterm2'
cask 'postman'
# cask 'insomnia'
# cask 'graphiql'
cask 'gpg-suite'
cask 'rescuetime'

tap "homebrew/cask-fonts"
cask 'font-fira-code'

# Install some CTF tools. https://ctftime.org/ctf-wtf/
brew 'aircrack-ng'
brew 'bfg'
brew 'binutils'
brew 'binwalk'
brew 'cifer'
brew 'dex2jar'
brew 'dns2tcp'
brew 'fcrackzip'
brew 'foremost'
brew 'hashpump'
brew 'hydra'
brew 'john'
brew 'knock'
brew 'netpbm'
brew 'nmap'
brew 'pngcheck'
brew 'socat'
brew 'sqlmap'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'ucspi-tcp' # `tcpserver` etc.
brew 'xpdf'
brew 'xz'
