# Not on homebrew:
# teamsql
# Be Focused, focus matrix, Google Backup and sync, RecordIt
# For these see also .exports
# RN: Xcode, # brew 'cocoapods' # cask 'java8' # react-native needs this version for android studio to build apk # cask 'intellij-idea' # cask 'android-studio' # mas 'Apple Configurator 2', id: 1037126344 # cask 'fastlane'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'jawshooah/pyenv'
tap 'universal-ctags/universal-ctags'
tap 'homebrew/cask-fonts'
cask_args appdir: '/Applications'

brew 'node' # system's latest node.js, for dev use nvm
brew 'go'
brew 'ruby'
brew 'readline'
brew 'python'
brew 'ansible'
brew 'pyenv'
brew 'pyenv-ccache'
# brew 'postgresql' # install via http://postgresapp.com/
# brew 'pgcli'
# brew 'mongodb' # use mongodb compass

brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'bash'
brew 'bash-completion'
brew 'wget'
brew 'vim'
brew 'grep'
brew 'openssh'
brew 'hub' # `hub fork`, `hub create`, `hub checkout <PRurl>`, https://github.com/github/hub
brew 'mtr' # mtr - ping & traceroute.
brew 'starship'
brew 'bat' # cat(1) with syntax highlighting and Git integration
brew 'exa' # for 'ls'
brew 'the_silver_searcher'
brew 'z'
brew 'fzf'
brew 'pv'
brew 'rename'
brew 'tree'
brew 'terminal-notifier'
brew 'pidcat' # colored logcat
brew 'ncdu'   # find where your diskspace went
brew 'zsh'
brew 'git-lfs' # https://git-lfs.github.com/
brew 'jq'
brew 'ack'
brew 'gnupg' # GnuPG to enable PGP-signing commits
brew 'screen'
brew 'awscli'
brew 'autojump'
brew 'cuetools'
brew 'curl'
brew 'htop'
brew 'ripgrep'
brew 'rclone'
brew 'rsync'

cask 'docker'
cask 'vagrant'
cask 'vimr'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'zoom'
cask 'virtualbox'
cask 'wireshark'
cask 'visual-studio-code'
cask 'postico'
# cask 'dbeaver-community'
cask 'skype'
cask 'firefox'
# cask 'google-chrome' # usually it's already there
cask 'slack'
cask 'spectacle'
cask 'iterm2'
cask 'postman'
cask 'insomnia'
# cask 'graphiql'
cask 'gpg-suite'
cask 'openvpn-connect'
# cask 'tunnelblick'
cask 'rescuetime'
cask 'itsycal'
cask 'flux'

# Some CTF tools. https://ctftime.org/ctf-wtf/
brew 'nmap'
brew 'socat'
# brew 'aircrack-ng'
# brew 'bfg'
# brew 'binutils'
# brew 'binwalk'
# brew 'cifer'
# brew 'dex2jar'
# brew 'dns2tcp'
# brew 'fcrackzip'
# brew 'foremost'
# brew 'hashpump'
# brew 'hydra'
# brew 'john'
# brew 'knock'
# brew 'netpbm'
# brew 'pngcheck'
# brew 'sqlmap'
# brew 'tcpflow'
# brew 'tcpreplay'
# brew 'tcptrace'
# brew 'ucspi-tcp' # `tcpserver`
# brew 'xpdf'
# brew 'xz'

# brew 'aria2'
# brew 'asciinema'
# brew 'dep'
# brew 'lame'
# brew 'ffmpeg', args: ['with-libvorbis', 'with-libvpx']
# brew 'flac'
# brew 'flake8'
# brew 'global'
# brew 'httpie'
# brew 'icdiff'
# brew 'mitmproxy'
# brew 'mosh'
# brew 'ncurses'
# brew 'neovim'
# brew 'par'
# brew 'proxychains-ng'
# brew 'restic'
# brew 'rust'
# brew 'shntool'
# brew 'stone-soup'
# brew 'telnet'
# brew 'the_silver_searcher'
# brew 'watchman'
# brew 'wavpack'
# brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']

# cask 'bitwarden'
# cask 'cleanmymac'
# cask 'dash'
# cask 'enpass'
# cask 'karabiner-elements'
# cask 'macvim'
# cask 'nordvpn'
# cask 'numi'
# cask 'paragon-ntfs'
# cask 'reaper'
# cask 'screenflick'
# cask 'shadowsocksx-ng'
# cask 'soundflower'
# cask 'sourcetree'
# cask 'steam'
# cask 'the-unarchiver'
# cask 'ticktick'

cask 'font-fira-code'
# cask 'font-fira-mono'
# cask 'font-fira-sans'
# cask 'font-pt-mono'
# cask 'font-pt-sans'
# cask 'font-pt-serif'
# cask 'font-roboto'
# cask 'font-roboto-condensed'
# cask 'font-roboto-mono'
# cask 'font-roboto-slab'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'
# cask 'font-trebuchet-ms'
# cask 'font-ubuntu'

brew 'mas'
mas 'Amphetamine', id: 937984704
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
# mas 'Magnet', id: 441258766
# mas 'Meta', id: 558317092
# mas 'Monosnap', id: 540348655
# mas 'Outline', id: 1356178125
# mas 'Quiver', id: 866773894
# mas 'Xcode', id: 497799835
