# Syntax examles:

# tap is used to add additional repositories which are not in the official formulae
# tap "telemachus/brew", "https://telemachus@bitbucket.org/telemachus/brew.git"

# brew "imagemagick"
# brew "mysql", restart_service: true, conflicts_with: ["homebrew/versions/mysql56"]
# brew "emacs", args: ["with-cocoa", "with-gnutls"]

# cask "google-chrome"
# cask "java" unless system "/usr/libexec/java_home --failfast"
# cask "firefox", args: { appdir: "~/my-apps/Applications" }

# mas is for Appstore apps: https://github.com/mas-cli/mas
# mas "1Password", id: 443987910

# brew 'docker'
# brew 'docker-compose' # use docker for mac https://docs.docker.com/v17.09/docker-for-mac/install/

# brew 'ack'
# brew 'imagemagick'
# brew 'jp2a'
# brew 'libcaca', args: ['with-imlib2']
# brew 'libgit2'
# brew 'readline'
# brew 'go'
# brew 'postgresql' # install via http://postgresapp.com/
brew 'pgcli' # https://www.mongodb.org/downloads#production
brew 'mongodb' # https://www.mongodb.org/downloads#production
brew 'python'
brew 'python3'
brew 'openssl'
brew 'ruby'
# brew 'ruby-build'
# brew 'rbenv'
# brew 'roundup'
# brew 'spaceman-diff'
# brew 'spark'
# brew 'unrar'
# brew 'youtube-dl'
# brew 'gnupg gnupg2'

# GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'
brew 'moreutils'
# GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew 'findutils'
# GNU `sed`, overwriting the built-in `sed`
brew 'gnu-sed', args: ['--with-default-names']

# Bash 4
brew 'bash'
brew 'bash-completion'
# brew 'homebrew/completions/brew-cask-completion'

# generic colouriser  http://kassiopeia.juls.savba.sk/~garabik/software/grc/
brew 'grc'

# wget with IRI support
# brew 'wget'# --with-iri'

# Install more recent versions of some OS X tools
brew 'vim', args: ['--with-override-system-vi']
brew 'grep'
brew 'openssh'
brew 'screen'

# z hopping around folders
brew 'z'

# "run this script when this file changes"
brew 'entr'

# github util. gotta love `hub fork`, `hub create`, `hub checkout <PRurl>`, https://github.com/github/hub
brew 'hub'
# brew 'gh'  # n/a


# mtr - ping & traceroute.
# brew 'mtr'

    # allow mtr to run without sudo
    # mtrlocation=$(brew info mtr | grep Cellar | sed -e 's/ (.*//')
    #  e.g. `/Users/name/.homebrew/Cellar/mtr/0.86`
    # sudo chmod 4755 $mtrlocation/sbin/mtr
    # sudo chown root $mtrlocation/sbin/mtr


# other useful binaries
brew 'the_silver_searcher'
brew 'fzf'

brew 'git'
# brew 'imagemagick'# --with-webp'

# This installs `npm` too using the recommended installation method
# brew 'node' # use nvm

brew 'pv'
brew 'rename'
brew 'tree'
# brew 'zopfli'
# brew 'ffmpeg' --with-libvpx

brew 'terminal-notifier'

brew 'pidcat'   # colored logcat guy

brew 'ncdu' # find where your diskspace went

brew 'zsh'


# RingoJS and Narwhal.
# Note that the order in which these are installed is important;
# see http://git.io/brew-narwhal-ringo.
# brew 'ringojs'
# brew 'narwhal'

# # some CTF tools; see https://github.com/ctfs/write-ups.
# brew aircrack-ng
# brew bfg
# brew binutils
# brew binwalk
# brew cifer
# brew dex2jar
# brew dns2tcp
# brew fcrackzip
# brew foremost
# brew hashpump
# brew hydra
# brew john
# brew knock
# brew netpbm
# brew nmap
# brew pngcheck
# brew socat
# brew sqlmap
# brew tcpflow
# brew tcpreplay
# brew tcptrace
# brew ucspi-tcp # `tcpserver` etc.
# brew xpdf
# brew xz

# brew 'dark-mode'
# brew ' exiv2'
brew 'git-lfs'  # https://git-lfs.github.com/
# brew 'lua'
# brew 'lynx'
# brew 'p7zip'
# brew 'pigz'
# brew 'rhino'
# brew 'speedtest_cli'
brew 'ssh-copy-id'
# brew 'testssl'
# brew 'vbindiff'
# brew 'webkit2png'

# # font tools.
# tap 'bramstein/webfonttools'
# brew 'sfnt2woff'
# brew 'sfnt2woff-zopfli'
# brew 'woff2'



##
## Cask
##

brew 'cocoapods'
cask_args appdir: '/Applications'

# cask is for Mac apps
# tap "caskroom/cask"
brew 'cask'
# brew 'brew-cask-completion' - n/a

# cask 'webstorm'
cask 'java8' # react-native needs this version for android studio to build apk
cask 'intellij-idea'
cask 'android-studio'
cask 'visual-studio-code'
cask 'fastlane'
cask 'virtualbox'
cask 'postico'

mas 'Apple Configurator 2', id: 1037126344

# cask '1password'
cask 'skype'
# cask 'adium'
# cask 'atom'
cask 'firefox'
# cask 'garmin-express'
cask 'google-chrome'
# cask 'handbrake'
# cask 'mapbox-studio'
# cask 'seashore'
# cask 'virtualbox'
cask 'slack'
# cask 'spotify'
# cask 'steam'
# cask 'transmission'
# cask 'tunnelbear'
# cask 'vlc'

# daily
cask 'spectacle'
# cask 'gyazo'
cask 'rescuetime'

# dev
cask 'iterm2'
# cask 'imagealpha'
# cask 'imageoptim'
tap 'caskroom/fonts'
cask 'font-fira-code'

# fun
# cask limechat

# # browsers
# cask google-chrome-canary
# cask firefoxnightly
# cask webkit-nightly
# cask chromium
# cask torbrowser

# # less often
# cask disk-inventory-x
# cask screenflow
# cask vlc
cask 'gpg-suite'
# cask licecap
# cask utorrent





# Not on homebrew
# VS Code
# File Multi Tool 5
# Phosphor
# postico, postgres,
# postman
# mongodb compass
# openvpn, tunnelblick
# docker

